new_bj/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location	"0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 6.94e-5;

boundaryField
{
    my-velocity-inlet
    {
        type            fixedValue;
        value           uniform 6.94e-5;
    }

    my-pressure-outlet
    {
        type            zeroGradient;
    }

    freeSurf
    {
        type            zeroGradient;
    }

    my-wall
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(frontPlanes|backPlanes)"
    {
        type            cyclic;
    }

}

// ************************************************************************* //
