new_bj/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 70860;

boundaryField
{
    my-velocity-inlet
    {
	type            totalPressure;
        psi             thermo:psi; 
	gamma		1.4;
        p0              uniform 116700;
        value           uniform 116700;
    }

    my-pressure-outlet
    {
        type            fixedValue;
	value		uniform 67978;
    }
     
    freeSurf
    {
        type            zeroGradient;
    }

    my-wall
    {
        type            zeroGradient;
    }

    "(frontPlanes|backPlanes)"
    {
        type            cyclic;
    }
}

// ************************************************************************* //
